Reports/СверкаДекларацийПрибыльНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>СверкаДекларацийПрибыльНДС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоляРасшифровки</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/НДСЗаписиКнигиПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>НДСЗаписиКнигиПродаж</Name>
			<Comment>НДС. Записи книги продаж</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НомерДокументаОплаты</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерДокументаОплаты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокументаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВидаОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОперации0</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НесырьевыеТовары</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчетаФактурыНаАванс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСчетаФактурыНаАванс</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИсправленияСчетаФактурыНаАванс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсправленияСчетаФактурыНаАванс</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетФактура</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаОС</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ГТДИмпорт</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПоступления</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыкупПредметовЛизинга</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.ПринятиеКУчетуОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеПеней</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОбОказанииПроизводственныхУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ОказаниеУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.МодернизацияОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаПлатежнойКартой</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеИзПереработки</v8:Type>
						<v8:Type>cfg:DocumentRef.ВосстановлениеНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявлениеОВвозеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияУслугПоПереработке</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеНачисленияНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеНДСКВычету</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияОтгруженныхТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеНДСпоСМРхозспособом</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦенности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЦенностей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОплаты</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаОС</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ГТДИмпорт</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыкупПредметовЛизинга</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.ПринятиеКУчетуОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияБух</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОбОказанииПроизводственныхУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаПлатежнойКартой</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияУслугПоПереработке</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеНачисленияНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СобытияПоНДСПродажи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаписьДополнительногоЛиста</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КорректируемыйПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СторнирующаяЗаписьДопЛиста</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Comment>Договор контрагента (для СФ на аванс, нал.агента по 161.5)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсправленныйСчетФактура</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПоступления</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/НДСРеализация0.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>НДСРеализация0</Name>
			<Comment>НДС по реализации 0%</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КурсоваяРазница</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СобытияПоНДСПродажи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НДССостоянияРеализация0</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетФактура</Name>
					<Comment>Счет-фактура (документ реализации)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ПередачаОС</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОбОказанииПроизводственныхУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияУслугПоПереработке</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеНачисленияНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияОтгруженныхТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦенности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЦенностей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Reports/СверкаДекларацийПрибыльНДС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("СформироватьОтчет", Истина);
	
КонецПроцедуры

#Область РасчетПоказатеей

// Параметры расчета показателей отчета
// 
// Возвращаемое значение:
//   - Структура - Параметры расчета
//
Функция ПараметрыРасчета() Экспорт
	
	ТекДата = ТекущаяДата();
	
	Результат = Новый Структура;
	Результат.Вставить("НачалоПериода", КонецГода(ТекДата));  
	Результат.Вставить("КонецПериода", КонецГода(ТекДата));  
	Результат.Вставить("Организация", Неопределено);
	
	Возврат Результат;
	
КонецФункции

// Функция - Рассчитать
// Рассчитывает показатели отчета
//
// Параметры:
//  ПараметрыРасчета - см. ПараметрыРасчета
// 
// Возвращаемое значение:
//  - см. НовыйТаблицаПоказателей
//
Функция Рассчитать(ПараметрыРасчета) Экспорт
	
	// Обработка расширенного периода
	ПараметрыРасчета = ОбщегоНазначения.СкопироватьРекурсивно(ПараметрыРасчета);
	ПараметрыРасчета.НачалоПериода = ?(
		Год(ПараметрыРасчета.НачалоПериода) <> Год(ПараметрыРасчета.КонецПериода),
		НачалоГода(ПараметрыРасчета.КонецПериода),
	   	ПараметрыРасчета.НачалоПериода
	);
	
	Возврат ПоказателиОтчета(ПараметрыРасчета);

КонецФункции

// Функция - Расшифровать показатель
//
// Параметры:
//  ПараметрыРасчета - см. ПараметрыРасчета
//  НомерПоказателя - Число
// 
// Возвращаемое значение:
//   - см. НовыйТаблицаПоказателей, Неопределено
//
Функция РасшифроватьПоказатель(ПараметрыРасчета, НомерПоказателя) Экспорт
	
	ОписаниеПоказателя = ОписаниеПоказателей(НомерПоказателя)[0];
	Если ЭтоПоказательДекларации(НомерПоказателя) Тогда
		Показатели = ?(НомерПоказателя < 2000, ПоказателиНП(ПараметрыРасчета), ПоказателиНДС(ПараметрыРасчета));
		Возврат Показатели.Скопировать(Показатели.НайтиСтроки(Новый Структура("Номер", НомерПоказателя)));
	ИначеЕсли ОписаниеПоказателя.Запрос <> Неопределено Тогда
		Запрос = ОписаниеПоказателей(НомерПоказателя)[0].Запрос;
		ДобавитьРасшифровку(Запрос);
		УстановитьПараметрыЗапроса(Запрос, ПараметрыРасчета);
		Возврат Запрос.Выполнить().Выгрузить();
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
		
КонецФункции

// Функция - Имеет расшифровку
//
// Параметры:
//  НомерПоказателя	 - Число
// 
// Возвращаемое значение:
//   - Булево
//
Функция ИмеетРасшифровку(НомерПоказателя) Экспорт
	
	ОписаниеПоказателя = ОписаниеПоказателей(НомерПоказателя)[0];
	Возврат ЭтоПоказательДекларации(НомерПоказателя) ИЛИ ОписаниеПоказателя.Запрос <> Неопределено;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПоляРасшифровкиСКД(ЭлементРасшифровки, Результат = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Результат = Новый Соответствие;
	КонецЕсли;
	
	Если ТипЗнч(ЭлементРасшифровки) <> Тип("ЭлементРасшифровкиКомпоновкиДанныхГруппировка") Тогда
		ПоляРасшифровки = ЭлементРасшифровки.ПолучитьПоля();
		Для Каждого ПолеРасшифровки Из ПоляРасшифровки Цикл
			Результат.Вставить(ПолеРасшифровки.Поле, ПолеРасшифровки.Значение);
		КонецЦикла;
	КонецЕсли; 
	
	Для Каждого ЭлементРодитель Из ЭлементРасшифровки.ПолучитьРодителей() Цикл
		ПоляРасшифровкиСКД(ЭлементРодитель, Результат);
	КонецЦикла;
	
	Возврат Новый ФиксированноеСоответствие(Результат);
	
КонецФункции

Функция ПолучитьТекстЗаголовка(ПараметрыОтчета) Экспорт 
	
	Заголовок = ?(
		ЗначениеЗаполнено(ПараметрыОтчета.ПоляРасшифровки),
		ПараметрыОтчета.ПоляРасшифровки["Представление"],
		Метаданные.Отчеты.СверкаДекларацийПрибыльНДС.Синоним
	);	
		
	Возврат СтрШаблон(
		НСтр("ru = '%1%2'"),
		Заголовок,
		БухгалтерскиеОтчетыКлиентСервер.ПолучитьПредставлениеПериода(
			ПараметрыОтчета.НачалоПериода, ПараметрыОтчета.КонецПериода)
	);
	
КонецФункции

Функция СформироватьОтчет(ПараметрыКомпоновки) Экспорт
	
	ДокументРезультат = Новый ТабличныйДокумент;
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	
	БухгалтерскиеОтчетыВызовСервера.ВывестиЗаголовокОтчета(
		ПараметрыКомпоновки.ПараметрыОтчета, КомпоновщикНастроек, ДокументРезультат);
	ДокументРезультат.Область("R1C1").Текст = СокрЛП(ДокументРезультат.Область("R1C1").Текст);
	ДокументРезультат.Область("R1C1:R1C11").Объединить();
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;	
	СкомпоноватьРезультатОтчета(ПараметрыКомпоновки, ДокументРезультат, ДанныеРасшифровки);
	
	ВывестиПримечания(ДокументРезультат, ДанныеРасшифровки);
	
	Возврат Новый Структура("Результат, ДанныеРасшифровки", ДокументРезультат, ДанныеРасшифровки);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ФормированиеОтчета

Процедура СкомпоноватьРезультатОтчета(ПараметрыКомпоновки, ДокументРезультат, ДанныеРасшифровки)
		
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		
	МакетКомпоновки = КомпоновщикМакета.Выполнить(
		ПараметрыКомпоновки.СКД, ПараметрыКомпоновки.Настройки, ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,
		НаборыДанныхСКД(ПараметрыКомпоновки), ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);

КонецПроцедуры 

// Выводит примечания из описания показателя, см. ОписаниеПоказателей
//
// Параметры:
//  ТабДок - ТабличныйДокумент - документ результат
//  ДанныеРасшифровки - ДанныеРасшифровкиКомпоновкиДанных - данные расшифровки СКД 
//
Процедура ВывестиПримечания(ТабДок, ДанныеРасшифровки)
	
	Для Строка = 1 По ТабДок.ВысотаТаблицы Цикл
		
		Для Колонка = 1 По ТабДок.ШиринаТаблицы Цикл
			
			Ячейка = ТабДок.Область(Строка, Колонка);
			Если ТипЗнч(Ячейка.Расшифровка) <> Тип("ИдентификаторРасшифровкиКомпоновкиДанных") Тогда
				Продолжить;
			КонецЕсли;
			ЭлементРасшифровки = ДанныеРасшифровки.Элементы[Ячейка.Расшифровка];
			ПоляРасшифровки = Отчеты.СверкаДекларацийПрибыльНДС.ПоляРасшифровкиСКД(ЭлементРасшифровки);

			ТекущееПоле = ЭлементРасшифровки.ПолучитьПоля();
			ТекущееПоле = ?(ТекущееПоле.Количество() = 0, "", ТекущееПоле[0].Поле);
			
			Если ТекущееПоле = "Показатель" И ЗначениеЗаполнено(ПоляРасшифровки["Примечание"]) Тогда
				Ячейка.Примечание.Текст = ПоляРасшифровки["Примечание"];
			КонецЕсли;
			
			Если СтрНайти(Ячейка.Формат,"НеАктуальный") > 0 Тогда
				Ячейка.Примечание.Текст = НСтр("ru='Показатель устарел, необходимо перезаполнить декларацию'");
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры

Функция НаборыДанныхСКД(ПараметрыКомпоновки)
	
	Если ПараметрыКомпоновки.Свойство("НаборыДанных") Тогда
		Возврат ПараметрыКомпоновки.НаборыДанных;
	КонецЕсли;
	
	ПараметрыОтчета = ПараметрыКомпоновки.ПараметрыОтчета;
	Если ЗначениеЗаполнено(ПараметрыОтчета.ПоляРасшифровки) Тогда	
		ПоляРасшифровки = ПараметрыОтчета.ПоляРасшифровки;
		Данные = РасшифроватьПоказатель(ПараметрыОтчета, ПоляРасшифровки["Номер"]);  					
		Если Данные.Колонки.Найти("Квартал") <> Неопределено Тогда
			Данные = Данные.Скопировать(
				Данные.НайтиСтроки(Новый Структура("Квартал", ПоляРасшифровки["Квартал"])));	
		КонецЕсли;  
	Иначе
	  	Данные = Рассчитать(ПараметрыОтчета);	
	КонецЕсли;
	
	Возврат Новый Структура("Данные", Данные);
	
КонецФункции

#КонецОбласти

#Область РасчетПоказателей

Функция ПоказателиОтчета(ПараметрыРасчета)

	Результат = НовыйТаблицаПоказателей();
	
	Источники = Новый Массив;
	Источники.Добавить(ПоказателиНП(ПараметрыРасчета));
	Источники.Добавить(ПоказателиНДС(ПараметрыРасчета));
	Источники.Добавить(ПоказателиРазниц(ПараметрыРасчета));
	
	Для Каждого Источник Из Источники Цикл
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Источник, Результат);
	КонецЦикла;
	
	ДобавитьИтогиРазниц(ПараметрыРасчета, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция ПоказателиНП(ПараметрыРасчета)
	
	Параметры = ОбщегоНазначения.СкопироватьРекурсивно(ПараметрыРасчета);
	Параметры.НачалоПериода = НачалоГода(ПараметрыРасчета.НачалоПериода);
	Декларации = ПоследниеДекларации(Параметры, "Прибыль");
	
	Показатели = НовыйПоказателиДеклараций();
	ОписаниеПоказателей = ОписаниеПоказателей("1(?!0)...");
	
	Кварталы = КварталыПериода(ПараметрыРасчета);
	Для Каждого Квартал Из Кварталы Цикл  
	
		ДобавитьПоказателиНП(Показатели, ОписаниеПоказателей, ПараметрыРасчета, Квартал.Номер, Декларации);
	
		Если Кварталы.Количество() = 1 И Квартал.Номер > 1 Тогда 
	
			ДобавитьПоказателиНП(Показатели, ОписаниеПоказателей, ПараметрыРасчета, Квартал.Номер, Декларации, Ложь);
	
		КонецЕсли;
	
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(
		ИтогПоКварталам(ПараметрыРасчета, Показатели, ОписаниеПоказателей("1000")[0]), Показатели);
	
	Возврат Показатели;
	
КонецФункции

// Рассчитывает показатели НДС нарастающим итогом, с расшифровкой по декларациям
//
// Параметры:
//  ПараметрыРасчета - см. ПараметрыРасчета - параметры расчета показаталей 
// 
// Возвращаемое значение:
//   - см. НовыйТаблицаПоказателей - показатели декларации
//
Функция ПоказателиНДС(ПараметрыРасчета)
	
	Декларации = ПоследниеДекларации(ПараметрыРасчета, "НДС");
	Показатели = НовыйПоказателиДеклараций();
	
	ОписаниеПоказателей = ОписаниеПоказателей("2[1-9]00");
	
	Кварталы = КварталыПериода(ПараметрыРасчета);
	КешПоказателей = Новый Соответствие; 
	// КешПоказателей - Соответствие[(Квартал, Показатель), Структура("Значение, НеАктуальный")]
	// кешируем показатели по ранее рассчитанным периодам 
	
	Для Каждого Квартал Из Кварталы Цикл
		
		КварталНачало = ?(Кварталы.Количество()=1, Квартал.Номер, 1); 
		
		ГруппаОрганизаций = Новый СписокЗначений();
		ГруппаОрганизаций.ЗагрузитьЗначения(Новый Массив(Справочники.Организации.ВсяОрганизация(ПараметрыРасчета.Организация, Квартал.Период))); 
		
		Декларация = Декларации.Найти(Квартал.Номер,"Квартал");     
		ДатаПодписи = ?(ЗначениеЗаполнено(Декларация), Декларация.ДатаПодписи, Неопределено);
		
		ПоказателиИБ = УчетНДСФормированиеОтчетности.РассчитатьПоказатели(
			Квартал.Период, ПараметрыРасчета.Организация, ГруппаОрганизаций,,ДатаПодписи
		);
			
		Для Каждого ОписаниеПоказателя Из ОписаниеПоказателей Цикл
			
			ЗначениеПоказателя = ЗначениеПоказателяНДС(Декларации.Найти(Квартал.Номер, "Квартал"), ПоказателиИБ, ОписаниеПоказателя);
			КешПоказателей.Вставить(СтрШаблон("%1_%2", Квартал.Номер, ОписаниеПоказателя.Номер), ЗначениеПоказателя);
			
			Для КварталОтчета = КварталНачало По Квартал.Номер Цикл 
				
				ЗначениеПоказателя = КешПоказателей[СтрШаблон("%1_%2", КварталОтчета, ОписаниеПоказателя.Номер)];
				Если Не (ЗначениеЗаполнено(ЗначениеПоказателя.Значение) ИЛИ ЗначениеПоказателя.НеАктуальный) Тогда
					Продолжить;
				КонецЕсли;
	
				Декларация = Декларации.Найти(КварталОтчета,"Квартал");
				Показатель = Показатели.Добавить();
				ЗаполнитьЗначенияСвойств(Показатель, ОписаниеПоказателя); 
				Показатель.Квартал = Квартал.Номер;   
				Показатель.ДатаОкончания = КварталКонец(Квартал.Период, КварталОтчета);
				Показатель.ДатаНачала = НачалоКвартала(Показатель.ДатаОкончания);
				ЗаполнитьЗначенияСвойств(Показатель, ЗначениеПоказателя);	
				Показатель.Регистратор = ?(ЗначениеЗаполнено(Декларация), Декларация.Ссылка, Неопределено);
				
			КонецЦикла;
			
		КонецЦикла;
			
	КонецЦикла;
			
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(
		ИтогПоКварталам(ПараметрыРасчета, Показатели, ОписаниеПоказателей(2000)[0]), Показатели);
	
	Возврат Показатели;
	
КонецФункции

Функция ПоказателиРазниц(ПараметрыРасчета)
	
	Результат = НовыйТаблицаПоказателей();
	
	РазницыПрибыль = РазницыПоКварталам(ПараметрыРасчета, "31(?!00)..");
	РазницыНДС = РазницыПоКварталам(ПараметрыРасчета, "32(?!00)..");
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(РазницыПрибыль, Результат);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(РазницыНДС, Результат);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(
		ИтогПоКварталам(ПараметрыРасчета, РазницыПрибыль, ОписаниеПоказателей("3100")[0]),
		Результат);

	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(
		ИтогПоКварталам(ПараметрыРасчета, РазницыНДС, ОписаниеПоказателей("3200")[0]),
		Результат);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

// Для расшифровки показателей разниц запрос должен выполнить следующие условия:
// 1. должен содержать следующие поля:
// - Номер - Число - номер показателя
// - Период - Дата - конец квартала
// - Значение - Число - сумма разницы
// 2. источник результирующего пакета должен иметь поле <Регистратор>, для расшифровки по документам
#Область Запросы

Функция ЗапросДекларации(ВидОтчета)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	РегламентированныйОтчет.Вид КАК Вид,
	|	РегламентированныйОтчет.ДатаНачала КАК ДатаНачала,
	|	РегламентированныйОтчет.ДатаОкончания КАК ДатаОкончания,
	|	РегламентированныйОтчет.Ссылка КАК Ссылка,
	|	РегламентированныйОтчет.Дата КАК Дата,
	|	РегламентированныйОтчет.ДанныеОтчета КАК ДанныеОтчета,
	|	КВАРТАЛ(РегламентированныйОтчет.ДатаОкончания) КАК Квартал,
	|	ВЫБОР
	|		КОГДА РегламентированныйОтчет.Вид = 0
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ РегламентированныйОтчет.ДатаПодписи
	|	КОНЕЦ КАК ДатаПодписи
	|ИЗ
	|	Документ.РегламентированныйОтчет КАК РегламентированныйОтчет
	|ГДЕ
	|	РегламентированныйОтчет.ПометкаУдаления = ЛОЖЬ
	|	И РегламентированныйОтчет.Организация = &Организация
	|	И РегламентированныйОтчет.ИсточникОтчета = &ИсточникОтчета
	|	И РегламентированныйОтчет.ДатаОкончания МЕЖДУ &НачалоПериода И &КонецПериода";

	Запрос.УстановитьПараметр("ИсточникОтчета", СтрШаблон("%1%2", "РегламентированныйОтчет", ВидОтчета)); 
	
	Возврат Запрос;
	
КонецФункции

Функция ЗапросРеализацияБезНДС()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	НДСЗаписиКнигиПродаж.Период КАК Период,
	|	3101 КАК Номер,
	|	НДСЗаписиКнигиПродаж.СуммаБезНДС КАК Значение
	|ИЗ
	|	РегистрНакопления.НДСЗаписиКнигиПродаж КАК НДСЗаписиКнигиПродаж
	|ГДЕ
	|	НДСЗаписиКнигиПродаж.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	И НДСЗаписиКнигиПродаж.Событие = ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПродажи.Реализация)
	|	И НДСЗаписиКнигиПродаж.Организация В(&Организации)
	|	И НЕ НДСЗаписиКнигиПродаж.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|	И НДСЗаписиКнигиПродаж.Активность";
	
	Возврат Запрос;

КонецФункции

Функция ЗапросВнереализационныеДоходы()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	ПрочиеДоходыИРасходы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ СтатьиДоходовРеализации
	|ИЗ
	|	Справочник.ПрочиеДоходыИРасходы КАК ПрочиеДоходыИРасходы
	|ГДЕ
	|	ПрочиеДоходыИРасходы.ВидПрочихДоходовИРасходов В(&ВидыДоходовРеализации)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.СуммаНУОборотКт КАК Значение,
	|	ХозрасчетныйОбороты.Период КАК Период,
	|	3102 КАК Номер
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Квартал,
	|			Счет В (&Счета),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы),
	|			Организация В (&Организации)
	|				И НЕ Субконто1 В
	|						(ВЫБРАТЬ
	|							СтатьиДоходовРеализации.Ссылка КАК Ссылка
	|						ИЗ
	|							СтатьиДоходовРеализации КАК СтатьиДоходовРеализации),
	|			,
	|			) КАК ХозрасчетныйОбороты";
	
	
	// Исходим из того что внереализационные доходы (Кт 91.01) в целом не облагаются НДС за исключением реализации:
	// необлагаемые НДС реализации 91.01 получаем из регистра НДС продажи в соответствующем показателе отчета,
	// всю остальную реализацию облагаемую как НДС так и налогом на прибыль исключаем данным фильтром,
	// таким образом остаются внереализационные доходы необлагаемые НДС, и отдельно реализация без НДС
	
	ВидыДоходовРеализации = Новый Массив;
	ВидыДоходовРеализации.Добавить(Перечисления.ВидыПрочихДоходовИРасходов.РеализацияПрочегоИмущества);
	ВидыДоходовРеализации.Добавить(Перечисления.ВидыПрочихДоходовИРасходов.РеализацияОсновныхСредств);
	ВидыДоходовРеализации.Добавить(Перечисления.ВидыПрочихДоходовИРасходов.РеализацияНематериальныхАктивов);
	ВидыДоходовРеализации.Добавить(Перечисления.ВидыПрочихДоходовИРасходов.РеализацияОбъектовСтроительства);
	Запрос.УстановитьПараметр("ВидыДоходовРеализации", ВидыДоходовРеализации);
	
	Счета = Новый Массив;
	Счета.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеДоходы);
	Запрос.УстановитьПараметр("Счета", Счета);
	
	Возврат Запрос;
	
КонецФункции

Функция ЗапросВозвратыПокупателям()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	НДСЗаписиКнигиПокупок.Период КАК Период,
	|	3103 КАК Номер,
	|	НДСЗаписиКнигиПокупок.Регистратор КАК Регистратор,
	|	-НДСЗаписиКнигиПокупок.СуммаБезНДС КАК Значение
	|ПОМЕСТИТЬ НдсПокупки
	|ИЗ
	|	РегистрНакопления.НДСЗаписиКнигиПокупок КАК НДСЗаписиКнигиПокупок
	|ГДЕ
	|	НДСЗаписиКнигиПокупок.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НДСЗаписиКнигиПокупок.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Возврат)
	|	И НДСЗаписиКнигиПокупок.Организация В(&Организации)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ХозрасчетныйДвиженияССубконто.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВозвратПрошлыхЛет
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто КАК ХозрасчетныйДвиженияССубконто
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НдсПокупки КАК НдсПокупки
	|		ПО ХозрасчетныйДвиженияССубконто.Регистратор = НдсПокупки.Регистратор
	|ГДЕ
	|	ХозрасчетныйДвиженияССубконто.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ХозрасчетныйДвиженияССубконто.Активность = ИСТИНА
	|	И ХозрасчетныйДвиженияССубконто.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеРасходы)
	|	И ХозрасчетныйДвиженияССубконто.СубконтоДт1 = &ВозвратТоваровПрошлыхЛет 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НдсПокупки.Период КАК Период,
	|	НдсПокупки.Номер КАК Номер,
	|	НдсПокупки.Значение КАК Значение
	|ИЗ
	|	НдсПокупки КАК НдсПокупки
	|ГДЕ
	|	НЕ НдсПокупки.Регистратор В
	|				(ВЫБРАТЬ
	|					ВозвратПрошлыхЛет.Регистратор КАК Регистратор
	|				ИЗ
	|					ВозвратПрошлыхЛет КАК ВозвратПрошлыхЛет)";	 
	
	Запрос.УстановитьПараметр("ВозвратТоваровПрошлыхЛет", 
		КлассификаторыДоходовРасходов.ПредопределенныйЭлемент(Справочники.ПрочиеДоходыИРасходы, "ВозвратТоваровПрошлыхЛет")); 
	
	Возврат Запрос;

КонецФункции

Функция ЗапросКорректировкиРеализацииНП()
			
	Запрос = ЗапросКорректировкиРеализации();
	Запрос.Текст = Запрос.Текст + 
	" 
	|;	
	|ВЫБРАТЬ
	|	Разницы.ДоходНП КАК Значение,
	|	Разницы.Период КАК Период,
	|	3105 КАК Номер
	|ИЗ
	|	Разницы КАК Разницы
	|ГДЕ
	|	Разницы.ДоходНП <> 0";
	
	Возврат Запрос;
	
КонецФункции

Функция ЗапросРеализацияОтгруженныхТоваров()

	//3106
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	Хозрасчетный.Период КАК Период,
	|	Хозрасчетный.СуммаНУКт КАК Значение,
	|	Хозрасчетный.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ Продажи
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Активность
	|	И Хозрасчетный.СчетКт В(&СчетаУчетаДоходов)
	|	И Хозрасчетный.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Хозрасчетный.Регистратор ССЫЛКА Документ.РеализацияОтгруженныхТоваров
	|	И Хозрасчетный.Организация В(&Организации)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НДСЗаписиКнигиПродаж.Период,
	|	-НДСЗаписиКнигиПродаж.СуммаБезНДС,
	|	НДСЗаписиКнигиПродаж.Регистратор
	|ИЗ
	|	РегистрНакопления.НДСЗаписиКнигиПродаж КАК НДСЗаписиКнигиПродаж
	|ГДЕ
	|	НДСЗаписиКнигиПродаж.Регистратор ССЫЛКА Документ.РеализацияОтгруженныхТоваров
	|	И НДСЗаписиКнигиПродаж.Активность = ИСТИНА
	|	И НДСЗаписиКнигиПродаж.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НДСЗаписиКнигиПродаж.Организация В(&Организации)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(Продажи.Период, КВАРТАЛ) КАК Период,
	|	СУММА(Продажи.Значение) КАК Значение,
	|	3106 КАК Номер
	|ИЗ
	|	Продажи КАК Продажи
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(Продажи.Период, КВАРТАЛ)";
	
	Запрос.УстановитьПараметр("СчетаУчетаДоходов", СчетаУчетаДоходов());
	
	Возврат Запрос;
	
КонецФункции

Функция ЗапросРеализацияНалоговомуАгентуНДС()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	НДСЗаписиКнигиПродажОбороты.СуммаБезНДСОборот КАК Значение,
	|	НДСЗаписиКнигиПродажОбороты.Период КАК Период,
	|	3107 КАК Номер
	|ИЗ
	|	РегистрНакопления.НДСЗаписиКнигиПродаж.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Организация В (&Организации)
	|				И Событие = ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПродажи.НалогИсчисляетПокупатель)
	|				И ДатаОплаты = ДАТАВРЕМЯ(1, 1, 1)) КАК НДСЗаписиКнигиПродажОбороты
	|ГДЕ
	|	НЕ НДСЗаписиКнигиПродажОбороты.Регистратор ССЫЛКА Документ.КорректировкаРеализации";
	
	Возврат Запрос;

КонецФункции

Функция ЗапросРеализацияНДС0()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	НДСРеализация0Обороты.Регистратор КАК Ссылка
	|ПОМЕСТИТЬ Документы
	|ИЗ
	|	РегистрНакопления.НДСРеализация0.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Организация В (&Организации)) КАК НДСРеализация0Обороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(Хозрасчетный.Период, КВАРТАЛ) КАК Период,
	|	3108 КАК Номер,
	|	СУММА(Хозрасчетный.СуммаНУКт) КАК Значение
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный КАК Хозрасчетный
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документы КАК Документы
	|		ПО Хозрасчетный.Регистратор = Документы.Ссылка
	|ГДЕ
	|	Хозрасчетный.Активность
	|	И Хозрасчетный.СчетКт В (&СчетаУчетаДоходов) 
	|	И Хозрасчетный.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(Хозрасчетный.Период, КВАРТАЛ)"; 
	
	Запрос.УстановитьПараметр("СчетаУчетаДоходов", СчетаУчетаДоходов());
	
	Возврат Запрос;

КонецФункции

Функция ЗапросКорректировкиПоступления() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	ХозрасчетныйОбороты.СуммаНУОборотКт КАК Значение,
	|	3109 КАК Номер,
	|	ХозрасчетныйОбороты.Период КАК Период
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Счет В (&СчетаУчетаДоходов), , Организация В (&Организации), КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КорректировкаРасчетовПрошлогоПериода), ) КАК ХозрасчетныйОбороты
	|ГДЕ
	|	ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.КорректировкаПоступления";
	
	Запрос.УстановитьПараметр("СчетаУчетаДоходов", СчетаУчетаДоходов());

	Возврат Запрос;
	
КонецФункции

Функция ЗапросБезвозмездныеПередачи()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	НДСЗаписиКнигиПродажОбороты.Период КАК Период,
	|	3201 КАК Номер,
	|	НДСЗаписиКнигиПродажОбороты.СуммаБезНДСОборот КАК Значение
	|ИЗ
	|	РегистрНакопления.НДСЗаписиКнигиПродаж.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Квартал,
	|			ТИПЗНАЧЕНИЯ(СчетФактура) = ТИП(Документ.ПередачаТоваров)
	|				И Организация В (&Организации)) КАК НДСЗаписиКнигиПродажОбороты";
	
	Возврат Запрос;

КонецФункции

Функция ЗапросВозвратыПоставщикам()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	НДСЗаписиКнигиПродажОбороты.СуммаБезНДСОборот КАК Значение,
	|	НДСЗаписиКнигиПродажОбороты.Период КАК Период,
	|	3202 КАК Номер
	|ИЗ
	|	РегистрНакопления.НДСЗаписиКнигиПродаж.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Квартал,
	|			Организация В (&Организации)
	|				И Событие = ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПродажи.Реализация)
	|				И ТИПЗНАЧЕНИЯ(СчетФактура) = ТИП(Документ.ВозвратТоваровПоставщику)) КАК НДСЗаписиКнигиПродажОбороты";
	
	Возврат Запрос;
	
КонецФункции

Функция ЗапросОтгрузкаБезПраваСобственности()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ Документы
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРеализацияТоваров.ОтгрузкаБезПереходаПраваСобственности)
	|	И РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РеализацияТоваровУслуг.Организация В (&Организации)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НДСЗаписиКнигиПродажОбороты.Период КАК Период,
	|	НДСЗаписиКнигиПродажОбороты.СуммаБезНДСОборот КАК Значение,
	|	3203 КАК Номер
	|ИЗ
	|	РегистрНакопления.НДСЗаписиКнигиПродаж.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Квартал,
	|			СчетФактура В
	|					(ВЫБРАТЬ
	|						Документы.Ссылка КАК Ссылка
	|					ИЗ
	|						Документы КАК Документы)
	|				И Организация В (&Организации)) КАК НДСЗаписиКнигиПродажОбороты";
	
	Возврат Запрос;
	
КонецФункции

Функция ЗапросКорректировкиРеализации()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	КорректировкаРеализации.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ Корректировки
	|ИЗ
	|	Документ.КорректировкаРеализации КАК КорректировкаРеализации
	|ГДЕ
	|	КорректировкаРеализации.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И КорректировкаРеализации.Организация В(&Организации)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	КорректировкаРеализации.Ссылка
	|ИЗ
	|	Документ.КорректировкаРеализации КАК КорректировкаРеализации
	|ГДЕ
	|	КорректировкаРеализации.ДатаИсходногоДокумента МЕЖДУ &НачалоПериода И &КонецПериода
	|	И КорректировкаРеализации.Организация В(&Организации)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(Хозрасчетный.СуммаНУКт) КАК СуммаНУКт,
	|	Хозрасчетный.Регистратор КАК Регистратор,
	|	НАЧАЛОПЕРИОДА(Хозрасчетный.Период, КВАРТАЛ) КАК Период
	|ПОМЕСТИТЬ ОборотыБУ
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный КАК Хозрасчетный
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Корректировки КАК Корректировки
	|		ПО Хозрасчетный.Регистратор = Корректировки.Ссылка
	|ГДЕ
	|	Хозрасчетный.СчетКт В(&СчетаУчетаДоходов)
	|	И Хозрасчетный.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Хозрасчетный.Активность
	|	И Хозрасчетный.СуммаНУКт <> 0
	|	И Хозрасчетный.СчетДт.Количественный = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	Хозрасчетный.Регистратор,
	|	НАЧАЛОПЕРИОДА(Хозрасчетный.Период, КВАРТАЛ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Регистратор КАК Регистратор,
	|	СУММА(ВложенныйЗапрос.СуммаБезНДС) КАК СуммаБезНДС,
	|	ВложенныйЗапрос.Период КАК Период
	|ПОМЕСТИТЬ ОборотыНДС
	|ИЗ
	|	(ВЫБРАТЬ
	|		НДСЗаписиКнигиПродаж.Регистратор КАК Регистратор,
	|		НДСЗаписиКнигиПродаж.СуммаБезНДС КАК СуммаБезНДС,
	|		НАЧАЛОПЕРИОДА(НДСЗаписиКнигиПродаж.КорректируемыйПериод, КВАРТАЛ) КАК Период
	|	ИЗ
	|		РегистрНакопления.НДСЗаписиКнигиПродаж КАК НДСЗаписиКнигиПродаж
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Корректировки КАК Корректировки
	|			ПО НДСЗаписиКнигиПродаж.Регистратор = Корректировки.Ссылка
	|	ГДЕ
	|		НДСЗаписиКнигиПродаж.Активность
	|		И НДСЗаписиКнигиПродаж.КорректируемыйПериод МЕЖДУ &НачалоПериода И &КонецПериода
	| 		И НДСЗаписиКнигиПродаж.Событие <> ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПродажи.НалогИсчисляетПокупатель)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСЗаписиКнигиПродаж.Регистратор,
	|		НДСЗаписиКнигиПродаж.СуммаБезНДС,
	|		НАЧАЛОПЕРИОДА(НДСЗаписиКнигиПродаж.Период, КВАРТАЛ)
	|	ИЗ
	|		РегистрНакопления.НДСЗаписиКнигиПродаж КАК НДСЗаписиКнигиПродаж
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Корректировки КАК Корректировки
	|			ПО НДСЗаписиКнигиПродаж.Регистратор = Корректировки.Ссылка
	|	ГДЕ
	|		НДСЗаписиКнигиПродаж.Активность
	|		И НДСЗаписиКнигиПродаж.КорректируемыйПериод = ДАТАВРЕМЯ(1, 1, 1)
	|		И НДСЗаписиКнигиПродаж.Период МЕЖДУ &НачалоПериода И &КонецПериода
	| 		И НДСЗаписиКнигиПродаж.Событие <> ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПродажи.НалогИсчисляетПокупатель)) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Регистратор,
	|	ВложенныйЗапрос.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Регистратор КАК Регистратор,
	|	СУММА(ВложенныйЗапрос.СуммаНУКт) КАК ДоходНП,
	|	СУММА(ВложенныйЗапрос.СуммаБезНДС) КАК ДоходНДС,
	|	ВложенныйЗапрос.Период КАК Период
	|ПОМЕСТИТЬ Разницы
	|ИЗ
	|	(ВЫБРАТЬ
	|		ОборотыБУ.Регистратор КАК Регистратор,
	|		ОборотыБУ.СуммаНУКт КАК СуммаНУКт,
	|		0 КАК СуммаБезНДС,
	|		ОборотыБУ.Период КАК Период
	|	ИЗ
	|		ОборотыБУ КАК ОборотыБУ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОборотыНДС.Регистратор,
	|		0,
	|		ОборотыНДС.СуммаБезНДС,
	|		ОборотыНДС.Период
	|	ИЗ
	|		ОборотыНДС КАК ОборотыНДС) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Регистратор,
	|	ВложенныйЗапрос.Период
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВложенныйЗапрос.СуммаНУКт) <> СУММА(ВложенныйЗапрос.СуммаБезНДС)";
	
	Запрос.УстановитьПараметр("СчетаУчетаДоходов", СчетаУчетаДоходов());

	Возврат Запрос;


КонецФункции

Функция ЗапросКорректировкиРеализацииНДС()
		
	Запрос = ЗапросКорректировкиРеализации();
	Запрос.Текст = Запрос.Текст + 
	"
	|;
	|ВЫБРАТЬ
	|	Разницы.ДоходНДС КАК Значение,
	|	Разницы.Период КАК Период,
	|	3204 КАК Номер
	|ИЗ
	|	Разницы КАК Разницы
	|ГДЕ
	|	Разницы.ДоходНДС <> 0";
		
	Возврат Запрос;
	
КонецФункции


#КонецОбласти

Функция ПоследниеДекларации(ПараметрыРасчета, ВидОтчета)
	
	Запрос = ЗапросДекларации(ВидОтчета);
	УстановитьПараметрыЗапроса(Запрос, ПараметрыРасчета);	
	Результат = Запрос.Выполнить().Выгрузить();  
	
	Типы = Новый Массив;
	Результат.Колонки.Добавить("Данные");  
	Результат.Колонки.Добавить("ДекларацияПодразделения");
	
	Для Каждого Декларация Из Результат Цикл
		Данные = Декларация.ДанныеОтчета.Получить();  
		Декларация.Данные = Данные; 
		Декларация.ДекларацияПодразделения = Отчеты.РегламентированныйОтчетПрибыль.ЭтоДекларацияПоНалогуНаПрибыльОбособленногоПодразделения(Декларация.Ссылка);
	КонецЦикла; 	
	Результат.Сортировать("ДекларацияПодразделения, Квартал, ДатаОкончания Убыв, Вид Убыв, ДатаПодписи");  
	
	Последние = Новый Массив;
	Для Каждого Квартал Из ОбщегоНазначенияКлиентСервер.СвернутьМассив(Результат.ВыгрузитьКолонку("Квартал")) Цикл 
		Последние.Добавить(НайтиСтроку(Результат,Новый Структура("Квартал", Квартал)));		
	КонецЦикла;
	
	Возврат Результат.Скопировать(Последние);
	
КонецФункции 

Функция НайтиСтроку(ТаблицаЗначений, Отбор) 
		
	Для Каждого Строка Из ТаблицаЗначений Цикл
		СоответствуетОтбору = Истина;	
		Для Каждого КлючЗначение Из Отбор Цикл
			Если КлючЗначение.Значение <> Строка[КлючЗначение.Ключ] Тогда
				СоответствуетОтбору = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла; 
		Если СоответствуетОтбору Тогда
			Возврат Строка;
		КонецЕсли;
	КонецЦикла;   
	
	Возврат Неопределено;
	
КонецФункции

Функция ЭтоПоказательДекларации(НомерПоказателя)
	
	Возврат СтрПодобнаПоРегулярномуВыражению(XMLСтрока(НомерПоказателя), "[1-2][1-9]00");
	
КонецФункции

Функция ЗначениеПоказателяНП(Декларация, ПоказателиИБ, ОписаниеПоказателя)
	
	// Получаем значение показателя налога на прибыль на основе данных декларации, 
	// текущих показателей базы и описания показателя
	
	Результат = Новый Структура("Значение, НеАктуальный", 0, Ложь); 
	Если ПоказателиИБ = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Значение = 0;
	ЗначениеИБ = ПоказателиИБ[ОписаниеПоказателя.Имя];
	
	Если ЗначениеЗаполнено(Декларация) Тогда
		ЗначениеРаздела = РегламентированныйОтчетПрибыль.ЗначениеМногоуровневогоРаздела(Декларация.Данные, "Лист02", ОписаниеПоказателя.КодМакета); 
		Если ЗначениеЗаполнено(ЗначениеРаздела) Тогда
			Значение = ЗначениеРаздела;	
		КонецЕсли;
	Иначе
		Значение = ЗначениеИБ;
	КонецЕсли; 
	
	Результат.Значение = Значение;  
	Разница = Значение - ЗначениеИБ; 
	Результат.НеАктуальный = Разница >= 1 ИЛИ Разница <=-1;  
		
	Возврат Результат;
	
КонецФункции

Функция ЗначениеПоказателяНДС(Декларация, ПоказателиИБ, ОписаниеПоказателя)
	
	// Получаем значение показателя НДС на основе данных декларации, 
	// текущих показателей базы и описания показателя
	
	Результат = Новый Структура("Значение, НеАктуальный", 0 , Ложь);	
	Раздел = ПоказателиИБ[ОписаниеПоказателя.Раздел];               
	Если Не Раздел.Свойство(ОписаниеПоказателя.КодМакета) Тогда
		Возврат Результат;	
	КонецЕсли;              
		
	Ставка = СтрРазделить(ОписаниеПоказателя.Имя,"_");
	ВТомЧислеНДС = Ставка.Количество() > 2;

	Значение = 0; 
	ЗначениеИБ = Раздел[ОписаниеПоказателя.КодМакета];

	Если ВТомЧислеНДС Тогда
		ЗначениеИБ = ЗначениеИБ - ЗначениеИБ / Число(Ставка[2]) * Число(Ставка[1]);		
	КонецЕсли;
		
	Если ЗначениеЗаполнено(Декларация) Тогда 
		Попытка   
			ИмяРаздела = СтрШаблон("%1%2","ПолеТабличногоДокумента", ОписаниеПоказателя.Раздел);
			Значение = Декларация.Данные.ПоказателиОтчета[ИмяРаздела][ОписаниеПоказателя.КодМакета];  
			Если ВТомЧислеНДС Тогда
				КодНДС = Лев(ОписаниеПоказателя.КодМакета, СтрДлина(ОписаниеПоказателя.КодМакета) - 1) + "5";	
				ЗначениеНДС =  Декларация.Данные.ПоказателиОтчета[ИмяРаздела][КодНДС];
				Значение = Значение - ЗначениеНДС;
			КонецЕсли;
		Исключение   
			ЗаписьЖурналаРегистрации(
				"ЗначениеПоказателяНДС", 
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Отчеты.СверкаДекларацийПрибыльНДС,,
				"Не удалось получить значение декларации");
		КонецПопытки;
	Иначе
		Значение = ЗначениеИБ;
	КонецЕсли;
	
	Результат.Значение = Значение;  
	Разница = Значение - ЗначениеИБ;	  
	Результат.НеАктуальный = Разница >= 1 ИЛИ Разница <=-1;
	
	Возврат Результат;
	
КонецФункции

Функция ОписаниеПоказателей(Знач ШаблонНомера = "[0-9]{4}")
	
	Если ТипЗнч(ШаблонНомера) = Тип("Число") Тогда
		ШаблонНомера = XMLСтрока(ШаблонНомера);
	КонецЕсли;
	
	Результат = НовыйОписаниеПоказателей();
	
	Раздел3 = "Раздел3";
	
	Показатель = Результат.Добавить();
	Показатель.Имя = "РеализацияПрибыль";
	Показатель.Представление = НСтр("ru='1. Реализация из декларации по налогу на прибыль'");
	Показатель.Номер = 1000;
	
	Показатель = Результат.Добавить();  
	Показатель.Имя = "Доходы.Реализация";
	Показатель.Представление = НСтр("ru='Доходы от реализации'");
	Показатель.Номер = 1100;
	Показатель.КодМакета = "П000020001003";
	Показатель.Раздел = "Лист02";
	Показатель.Примечание = НСтр("ru='Доходы от реализации (стр.040 Приложения 1 к Листу 02):
	|Лист 02 строка 010'");
	
	Показатель = Результат.Добавить();
	Показатель.Имя = "Доходы.Внереализационные";
	Показатель.Представление = НСтр("ru='Внереализационные доходы'");
	Показатель.Номер = 1200;
	Показатель.КодМакета = "П000020002003";
	Показатель.Раздел = "Лист02";
	Показатель.Примечание = НСтр("ru='Доходы от реализации (стр.040 Приложения 1 к Листу 02):
	|Лист 02 строка 020'");
	
	Показатель = Результат.Добавить();
	Показатель.Имя = "РеализацияНДС";
	Показатель.Представление = НСтр("ru='2. Реализация из декларации по НДС'");
	Показатель.Номер = 2000;
	
	Показатель = Результат.Добавить();
	Показатель.Имя = "РеализацияНДС_22";
	Показатель.Представление = НСтр("ru='По ставке 22%'");
	Показатель.Номер = 2100;        
	Показатель.КодМакета = "П000300000303";
	Показатель.Раздел = Раздел3;
	Показатель.Примечание = НСтр("ru='Реализация по ставке 22%:
	|Раздел 3 строка 003'");    
	
	Показатель = Результат.Добавить();
	Показатель.Имя = "РеализацияНДС_22_122";
	Показатель.Представление = НСтр("ru='По ставке 22/122%'");
	Показатель.Номер = 2200;        
	Показатель.КодМакета = "П000300000503";
	Показатель.Раздел = Раздел3;
	Показатель.Примечание = НСтр("ru='Реализация по ставке 22%:
	|Раздел 3 строка 005'");
                                 
	Показатель = Результат.Добавить();
	Показатель.Имя = "РеализацияНДС_20";
	Показатель.Представление = НСтр("ru='По ставке 20%'");
	Показатель.Номер = 2300;
	Показатель.КодМакета = "П000300001003";
	Показатель.Раздел = Раздел3;
	Показатель.Примечание = НСтр("ru='Реализация по ставке 20%:
	|Раздел 3 строка 010'");

	Показатель = Результат.Добавить();
	Показатель.Имя = "РеализацияНДС_10";
	Показатель.Представление = НСтр("ru='По ставке 10%'");
	Показатель.Уровень = 2;
	Показатель.Номер = 2400;	
	Показатель.КодМакета = "П000300002003"; 
	Показатель.Раздел = Раздел3;
	Показатель.Примечание = НСтр("ru='Реализация по ставке 10%:
	|Раздел 3 строка 020'");

	Показатель = Результат.Добавить();
	Показатель.Имя = "РеализацияНДС_7";
	Показатель.Представление = НСтр("ru='По ставке 7%'");
	Показатель.Номер = 2500;	
	Показатель.КодМакета = "П000300002103"; 
	Показатель.Раздел = Раздел3;
	Показатель.Примечание = НСтр("ru='Реализация по ставке 7%:
	|Раздел 3 строка 021'");
	
	Показатель = Результат.Добавить();
	Показатель.Имя = "РеализацияНДС_5";
	Показатель.Представление = НСтр("ru='По ставке 5%'");
	Показатель.Номер = 2600;	
	Показатель.КодМакета = "П000300002203"; 
	Показатель.Раздел = Раздел3;
	Показатель.Примечание = НСтр("ru='Реализация по ставке 5%:
	|Раздел 3 строка 022'");   
	
	Показатель = Результат.Добавить();
	Показатель.Имя = "РеализацияНДС_20_120";
	Показатель.Представление = НСтр("ru='По ставке 20/120%'");
	Показатель.Номер = 2700;	
	Показатель.КодМакета = "П000300003003"; 
	Показатель.Раздел = Раздел3;
	Показатель.Примечание = НСтр("ru='Реализация по ставке 20/120%:
	|Раздел 3 строка 030'");
	
	Показатель = Результат.Добавить();
	Показатель.Имя = "РеализацияНДС_10_110";
	Показатель.Представление = НСтр("ru='По ставке 10/110%'");
	Показатель.Номер = 2800;	    
	Показатель.КодМакета = "П000300004003"; 
	Показатель.Раздел = Раздел3;
	Показатель.Примечание = НСтр("ru='Реализация по ставке 10/110%:
	|Раздел 3 строка 040'");

	Показатель = Результат.Добавить();
	Показатель.Имя = "РазницыИтого";
	Показатель.Представление = НСтр("ru='3. Разницы (1 - 2) = (3.1 - 3.2 + 3.3)'");
	Показатель.Номер = 3000;

	Показатель = Результат.Добавить();
	Показатель.Имя = "РазницыПрибыль";
	Показатель.Представление = НСтр("ru='3.1 В декларации по налогу на прибыль'");
	Показатель.Номер = 3100;
	
	Показатель = Результат.Добавить();
	Показатель.Имя = "РеализацияБезНДС";
	Показатель.Представление = НСтр("ru='Реализация без НДС'");
	Показатель.Номер = 3101;
	Показатель.Запрос = ЗапросРеализацияБезНДС();
	
	Показатель = Результат.Добавить();
	Показатель.Имя = "ВнереализационныеДоходы";
	Показатель.Представление = НСтр("ru='Внереализационные доходы'");
	Показатель.Номер = 3102; 
	Показатель.Запрос = ЗапросВнереализационныеДоходы();
	
	Показатель = Результат.Добавить();
	Показатель.Имя = "ВозвратыПокупателям";
	Показатель.Представление = НСтр("ru='Возвраты товаров от покупателей'");
	Показатель.Номер = 3103;
	Показатель.Запрос = ЗапросВозвратыПокупателям();
		
	Показатель = Результат.Добавить();
	Показатель.Имя = "КорректировкиРеализацииНП";
	Показатель.Представление = НСтр("ru='Корректировки реализации'"); 
	Показатель.Номер = 3105;
	Показатель.Запрос = ЗапросКорректировкиРеализацииНП();
	
	Показатель = Результат.Добавить();
	Показатель.Имя = "РеализацияОтгруженныхТоваров";
	Показатель.Представление = НСтр("ru='Реализация отгруженных товаров'");
	Показатель.Номер = 3106;
	Показатель.Запрос = ЗапросРеализацияОтгруженныхТоваров();
	
	Показатель = Результат.Добавить();
	Показатель.Имя = "РеализацияНалоговомуАгентуНДС";
	Показатель.Представление = НСтр("ru='Реализация налоговому агенту НДС'");
	Показатель.Номер = 3107;
	Показатель.Запрос = ЗапросРеализацияНалоговомуАгентуНДС();
	
	Показатель = Результат.Добавить();
	Показатель.Имя = "РеализацияНДС0";
	Показатель.Представление = НСтр("ru='Реализация НДС 0%'"); 
	Показатель.Номер = 3108;
	Показатель.Запрос = ЗапросРеализацияНДС0();  
	
	Показатель = Результат.Добавить();
	Показатель.Имя = "КорректировкиПоступления";
	Показатель.Представление = НСтр("ru='Корректировки поступления'"); 
	Показатель.Номер = 3109;
	Показатель.Запрос = ЗапросКорректировкиПоступления(); 
		
	Показатель = Результат.Добавить();
	Показатель.Имя = "РазницыНДС";
	Показатель.Представление = НСтр("ru='3.2 В декларации по НДС'"); 
	Показатель.Номер = 3200;

	Показатель = Результат.Добавить();
	Показатель.Имя = "БезвозмездныеПередачи";
	Показатель.Представление = НСтр("ru='Безвозмездные передачи'");
	Показатель.Номер = 3201;
	Показатель.Запрос = ЗапросБезвозмездныеПередачи();
	
	Показатель = Результат.Добавить();
	Показатель.Имя = "ВозвратыПоставщикам";
	Показатель.Представление = НСтр("ru='Возвраты товаров поставщикам'");
	Показатель.Номер = 3202;
	Показатель.Запрос = ЗапросВозвратыПоставщикам();

	Показатель = Результат.Добавить();
	Показатель.Имя = "ОтгрузкаБезПраваСобственности";
	Показатель.Представление = НСтр("ru='Отгрузка без перехода права собственности'");
	Показатель.Номер = 3203;
	Показатель.Запрос = ЗапросОтгрузкаБезПраваСобственности(); 
	
	Показатель = Результат.Добавить();
	Показатель.Имя = "КорректировкиРеализацииНДС";
	Показатель.Представление = НСтр("ru='Корректировки реализации'"); 
	Показатель.Номер = 3204;
	Показатель.Запрос = ЗапросКорректировкиРеализацииНДС();
	
	Показатель = Результат.Добавить();
	Показатель.Имя = "РазницыОшибки";
	Показатель.Представление = НСтр("ru='3.3 Ошибки и расхождения'");
	Показатель.Номер = 3300;
	
	Отбор = Новый Массив;
	Для Каждого Описание Из Результат Цикл 

		Номер = XMLСтрока(Описание.Номер);
		Описание.Уровень = УровеньПоказателя(Номер);
		
		Если СтрПодобнаПоРегулярномуВыражению(Строка(Номер), ШаблонНомера) Тогда
			Отбор.Добавить(Описание);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат.Скопировать(Отбор);
	
КонецФункции

Функция УровеньПоказателя(НомерПоказателя)
	
	Если СтрПодобнаПоРегулярномуВыражению(НомерПоказателя, "[1-9]000") Тогда
		Возврат 1;
	ИначеЕсли СтрПодобнаПоРегулярномуВыражению(НомерПоказателя, "[1-9]{2}00") Тогда
		Возврат 2;
	Иначе 
		Возврат 3;
	КонецЕсли;

КонецФункции

Функция НовыйТаблицаПоказателей()
	
	ТипСтрока = Новый ОписаниеТипов("Строка");
	ТипЧисло = Новый ОписаниеТипов("Число"); 
	ТипБулево = Новый ОписаниеТипов("Булево"); 
	
	Результат = Новый ТаблицаЗначений;

	Результат.Колонки.Добавить("Имя", ТипСтрока); 
	Результат.Колонки.Добавить("Представление", ТипСтрока);
	Результат.Колонки.Добавить("Уровень", ТипЧисло);
	Результат.Колонки.Добавить("Номер", ТипЧисло);
	Результат.Колонки.Добавить("Раздел", ТипСтрока);
	Результат.Колонки.Добавить("КодМакета", ТипСтрока);
	Результат.Колонки.Добавить("Примечание", ТипСтрока);

	Результат.Колонки.Добавить("НеАктуальный", ТипБулево);
	Результат.Колонки.Добавить("Значение", ТипЧисло);
	Результат.Колонки.Добавить("Квартал", ТипЧисло);
	
	Возврат Результат;

КонецФункции

Функция НовыйОписаниеПоказателей()
	
	Результат = НовыйТаблицаПоказателей();
	
	Результат.Колонки.Удалить("Значение");
	Результат.Колонки.Удалить("Квартал");
	Результат.Колонки.Удалить("НеАктуальный");
	Результат.Колонки.Добавить("Запрос");
	
	Возврат Результат;
	
КонецФункции

Функция НовыйПоказателиДеклараций()
	
	Результат = НовыйТаблицаПоказателей();
	// Для НДС имя показателя включает значение расчетных ставок (20/120, 10/110).
	// НДС по расчетным ставкам извлекаем из значения, делаем это в отчете,
	// так как алгоритм заполнения контейнера не рассчитывает значение суммы НДС
	// см.ЗначениеПоказателяНДС
	
	Результат.Колонки.Добавить("Регистратор");
	Результат.Колонки.Добавить("ДатаНачала");
	Результат.Колонки.Добавить("ДатаОкончания");

	Возврат Результат;

КонецФункции

Функция РазницыПоКварталам(ПараметрыРасчета, ШаблонНомера) 

	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	1 КАК Номер
	|ПОМЕСТИТЬ Кварталы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	4
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Разницы.Период КАК Период,
	|	Разницы.Значение КАК Значение,
	|	Разницы.Номер КАК Номер
	|ПОМЕСТИТЬ Разницы
	|ИЗ
	|	&Разницы КАК Разницы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(Разницы.Значение) КАК Значение,
	|	Разницы.Номер КАК Номер,
	|	Кварталы.Номер КАК Квартал
	|ИЗ
	|	Разницы КАК Разницы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Кварталы КАК Кварталы
	|		ПО (Кварталы.Номер >= КВАРТАЛ(Разницы.Период))
	|ГДЕ
	|	Кварталы.Номер >= КВАРТАЛ(&НачалоПериода)
	|	И Кварталы.Номер <= КВАРТАЛ(&КонецПериода)
	|
	|СГРУППИРОВАТЬ ПО
	|	Разницы.Номер,
	|	Кварталы.Номер";      
	
	УстановитьПараметрыЗапроса(Запрос,ПараметрыРасчета);
	Запрос.УстановитьПараметр("Разницы", РазницыПоПериодам(ПараметрыРасчета, ШаблонНомера));
	Разницы = Запрос.Выполнить().Выгрузить();
	
	Показатели = НовыйТаблицаПоказателей();
	
	ОписаниеПоказателей = ОписаниеПоказателей();
	Для Каждого Разница Из Разницы Цикл
		Показатель = Показатели.Добавить();
		ЗаполнитьЗначенияСвойств(Показатель, ОписаниеПоказателей.Найти(Разница.Номер, "Номер"));
		ЗаполнитьЗначенияСвойств(Показатель, Разница);
	КонецЦикла;
	
	Возврат Показатели;
	
КонецФункции

Функция РазницыПоПериодам(ПараметрыРасчета, ШаблонНомера) 

	ОписаниеПоказателей = ОписаниеПоказателей(ШаблонНомера);
	
	Результат = Неопределено;
	Для Каждого ОписаниеПоказателя Из ОписаниеПоказателей Цикл 
		
		Запрос = ОписаниеПоказателя.Запрос;
		Если Запрос = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		УстановитьПараметрыЗапроса(Запрос, ПараметрыРасчета);
		
		Разницы = Запрос.Выполнить().Выгрузить();
		Если Результат = Неопределено Тогда
			Результат = Разницы;
			Продолжить;
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Разницы, Результат);	
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура УстановитьПараметрыЗапроса(Запрос, ПараметрыРасчета)

	Запрос.УстановитьПараметр("Организация", ПараметрыРасчета.Организация);
	Запрос.УстановитьПараметр("Организации", Справочники.Организации.ВсяОрганизация(ПараметрыРасчета.Организация, ПараметрыРасчета.КонецПериода));
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыРасчета.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", ПараметрыРасчета.КонецПериода);

КонецПроцедуры

Функция КварталыПериода(ПараметрыРасчета)

	Результат = Новый Массив();
	КварталНачало = Месяц(КонецКвартала(ПараметрыРасчета.НачалоПериода)) / 3;
	КварталКонец = Месяц(КонецКвартала(ПараметрыРасчета.КонецПериода)) / 3;
	
	Для Квартал = КварталНачало По КварталКонец Цикл
		Результат.Добавить(Новый Структура("Номер, Период", Квартал, КварталКонец(ПараметрыРасчета.НачалоПериода,Квартал)));
	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция ИтогПоКварталам(ПараметрыРасчета, Показатели, ОписаниеПоказателя)
	
	Результат = НовыйТаблицаПоказателей();
	
	Для Каждого Квартал Из КварталыПериода(ПараметрыРасчета) Цикл
		НовыйПоказатель = Результат.Добавить();	 
		ЗаполнитьЗначенияСвойств(НовыйПоказатель, ОписаниеПоказателя);
		НовыйПоказатель.Квартал = Квартал.Номер;
		Для Каждого Показатель  Из Показатели Цикл 
			Если Показатель.Квартал = НовыйПоказатель.Квартал Тогда
				НовыйПоказатель.Значение = НовыйПоказатель.Значение + Показатель.Значение;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьИтогиРазниц(ПараметрыРасчета, Показатели)
	
	ПоказателиДеклараций = Показатели.Скопировать(Показатели.НайтиСтроки(Новый Структура("Уровень",1)));  
	
	СтрокиНДС = ПоказателиДеклараций.НайтиСтроки(Новый Структура("Номер",2000));
	Для Каждого Строка Из СтрокиНДС Цикл
		Строка.Значение = -Строка.Значение;
	КонецЦикла;		
	РазницыИтого = ИтогПоКварталам(ПараметрыРасчета, ПоказателиДеклараций, ОписаниеПоказателей(3000)[0]);		
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(РазницыИтого,Показатели);
	
	ОшибкиПротиворечия = ОписаниеПоказателей(3300)[0];
	Для Каждого Разница Из РазницыИтого Цикл
		Показатель = Показатели.Добавить();	
		ЗаполнитьЗначенияСвойств(Показатель, ОшибкиПротиворечия);
		Показатель.Квартал = Разница.Квартал;    
		РазницаПрибыль = Показатели.НайтиСтроки(Новый Структура("Номер, Квартал", 3100, Разница.Квартал));
		РазницаНДС = Показатели.НайтиСтроки(Новый Структура("Номер, Квартал", 3200, Разница.Квартал));
		Показатель.Значение = Разница.Значение - РазницаПрибыль[0].Значение + РазницаНДС[0].Значение;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьРасшифровку(Запрос, ПараметрыИсточника = Неопределено, ВыбираемыеПоля = Неопределено)
	
	Если ПараметрыИсточника = Неопределено Тогда
		ПараметрыИсточника = Новый Соответствие;
		ПараметрыИсточника.Вставить("Квартал","Регистратор");
	КонецЕсли;
	
	Если ВыбираемыеПоля = Неопределено Тогда
		ВыбираемыеПоля = Новый Соответствие;
		ВыбираемыеПоля.Вставить("Регистратор", "Регистратор");
	КонецЕсли;
	
	ТочкаЗапроса = СхемыЗапросов.НайтиЗапросРезультата(Запрос.Текст);
	Источник = ТочкаЗапроса.Запрос.Операторы[0].Источники[0].Источник;
	
	Для Каждого ПараметрИсточника Из ПараметрыИсточника Цикл
		
		Если ТипЗнч(ПараметрИсточника.Ключ) = Тип("Число") Тогда 
			Параметр = Источник.Параметры[ПараметрИсточника.Ключ];
		Иначе
			Параметр = Источник.Параметры.Найти(ПараметрИсточника.Ключ);
		КонецЕсли;
		Если Параметр = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Параметр.Выражение = Новый ВыражениеСхемыЗапроса(ПараметрИсточника.Значение);
		
	КонецЦикла;  
	
	Оператор = ТочкаЗапроса.Запрос.Операторы[0];
	Источник = Оператор.Источники[0].Источник.Псевдоним;  
	
	Для Каждого ВыбираемоеПоле Из ВыбираемыеПоля Цикл
		
		ИмяПоля = СтрШаблон("%1.%2", Источник, ВыбираемоеПоле.Ключ); 
		Оператор.ВыбираемыеПоля.Добавить(ИмяПоля);
				
	КонецЦикла;
	
	Запрос.Текст = ТочкаЗапроса.Схема.ПолучитьТекстЗапроса();
	
КонецПроцедуры

Функция КварталКонец(Период, НомерКвартала) 
	
	Возврат КонецКвартала(ДобавитьМесяц(НачалоГода(Период), (НомерКвартала - 1) * 3));
	
КонецФункции

Процедура ДобавитьПоказателиНП(Показатели, ОписаниеПоказателей, ПараметрыРасчета, КварталПоказателя, Декларации, Текущий = Истина)

	КварталДекларации = ?(Текущий, КварталПоказателя, КварталПоказателя - 1);
	Декларация = Декларации.Найти(КварталДекларации, "Квартал"); 

	ПараметрыПоказателя = Новый Структура("ДатаНачала, Квартал, ДатаОкончания, Регистратор",
		НачалоГода(ПараметрыРасчета.НачалоПериода), КварталПоказателя);
	ПараметрыПоказателя.ДатаОкончания = КварталКонец(ПараметрыПоказателя.ДатаНачала, КварталДекларации);
	ПараметрыПоказателя.Регистратор = ?(ЗначениеЗаполнено(Декларация), Декларация.Ссылка, Неопределено);
	
	КонтекстРасчета = НалогНаПрибыльДекларация.НовыйКонтекстРасчета(ПараметрыРасчета.Организация, ПараметрыПоказателя.ДатаОкончания); 
	Если КонтекстРасчета = Неопределено Тогда
		ПоказателиИБ = Неопределено;
	Иначе
		ПоказателиИБ = НалогНаПрибыльДекларация.РассчитатьПоказатели(КонтекстРасчета, ОписаниеПоказателей.ВыгрузитьКолонку("Имя"));
	КонецЕсли;
	
	Для Каждого ОписаниеПоказателя Из ОписаниеПоказателей Цикл
	
		Показатель = Показатели.Добавить();  
		ЗаполнитьЗначенияСвойств(Показатель, ОписаниеПоказателя);
		ЗаполнитьЗначенияСвойств(Показатель, ПараметрыПоказателя);
		
		ЗаполнитьЗначенияСвойств(Показатель, ЗначениеПоказателяНП(Декларация, ПоказателиИБ, ОписаниеПоказателя));
		Если Не Текущий Тогда 
			Показатель.Значение = -Показатель.Значение;
		КонецЕсли;   
	
	КонецЦикла;
	
КонецПроцедуры

Функция СчетаУчетаДоходов()
	
	Счета = Новый Массив;
	Счета.Добавить(ПланыСчетов.Хозрасчетный.ВыручкаНеЕНВД);
	Счета.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеДоходы);
	
	Возврат Счета;
	
КонецФункции

#КонецОбласти 

#КонецЕсли
